{
  "archetype": "Data Dystopia",
  "logline": "A cracked digital display pulses with real-time metrics of competence, revealing the blurred lines between human expertise and AI-generated outputs.",
  "scene": "Inside a stark, dimly lit control room, rows of flickering monitors illuminate a table strewn with discarded diplomas and certification papers, symbols of a crumbling credentialing system. In the center, a holographic interface displays a continuous stream of performance evaluations for AI-assisted professionals, the metrics pulsating and shifting in real-time. Outside the glass wall, a crowd of anxious job seekers peer in, their faces reflecting confusion and frustration as they await evaluation in a world where traditional credentials have become meaningless. A subtle hum of machinery fills the air, hinting at the relentless processing of applications and outputs that now define competence.",
  "keyProps": [
    "flickering monitors displaying competency metrics",
    "discarded diplomas and certifications on the table",
    "a holographic interface with real-time performance data",
    "a waiting area filled with anxious job seekers",
    "industrial machinery subtly humming in the background"
  ],
  "camera": "Wide-angle shot capturing the control room's sweeping view, transitioning to close-ups of the holographic interface and the crowd outside.",
  "lighting": "Cold, fluorescent lighting that casts harsh shadows, emphasizing the starkness of the environment and the anxiety of the individuals present.",
  "productionDesign": "A mix of stark industrial materials like metal and glass, with a minimalist aesthetic that reflects a utilitarian approach to design. The control room is filled with a mix of obsolete technologies and cutting-edge holographic displays, symbolizing the transition from old systems to new chaos.",
  "signatureTwist": "The camera pans to reveal a subtle AI avatar, not humanoid, but instead represented as a series of shifting symbols and data streams, highlighting its omnipresence in evaluating human capability without ever being licensed itself.",
  "avoid": [
    "readable text",
    "logos",
    "watermarks",
    "humanoid robots",
    "generic HUD overlays",
    "abstract wallpaper"
  ]
}